Revit 2024 API
BuiltInFailures.FaceSplitterFailures.CannotUseCurvesForFaceSplit Property
 The sketch cannot split the face of the highlighted element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotUseCurvesForFaceSplit { get; }
Visual Basic
Public Shared ReadOnly Property CannotUseCurvesForFaceSplit As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotUseCurvesForFaceSplit {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.FaceSplitterFailures Class
Autodesk.Revit.DB Namespace